#### VertexPositionColored Members

---

|  |
| --- |
| VertexPositionColored Class   Constructors   Methods   Properties   See Also |

The  VertexPositionColored  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | VertexPositionColored | Constructs the vertex from a point and a color. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  Vertex  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetColor | Gets the vertex's color. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetColor | Sets the vertex's color. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Vertex  .) |
| Public property | Position | The vertex's position. |

# See Also

VertexPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace